/* choose button - open panel */
"Choose" = "Choose";

/* URL has not been specified - placeholder message */
"Please use the Inspector to enter the URL of a video." = "Please use the Inspector to enter the URL of a video.";

/* Live data feeds disabled message. */
"This is a placeholder for a video. The full video will appear once you publish this website, but to see the video in Sandvox, please enable live data feeds in the preferences." = "This is a placeholder for a video. The full video will appear once you publish this website, but to see the video in Sandvox, please enable live data feeds in the preferences.";

